**This is a previous example**
* Source link https://github.com/Sven-Bo/streamlit-sales-dashboard
* Source video https://www.youtube.com/watch?v=Sb0A9i6d320&ab_channel=CodingIsFun

## Main Py

#### Import modules

In [2]:
#MODULES
import pandas as pd  #we need pandas for dataframes,  pip install pandas
# import plotly.express as px  #we need ploty for graphs, pip install plotly-express
import streamlit as st  #we need streamlit for visualisation, pip install streamlit
import numpy as np
import seaborn as sns
import sqlite3

#### Set the page view

In [3]:
#View
st.set_page_config(
    page_title="SQL Dashboard", #Web page title
    page_icon=":bar_chart:", #Web page icon
    layout="wide")  #Web page layout

#### DataFrames

In [4]:
df_activity = pd.read_csv('CSV/activity.csv')
print(df_activity.shape)
print(df_activity.head())

(19515324, 5)
   EntityNumber  ActivityGroup  NaceVersion  NaceCode Classification
0  0200.065.765              6         2008     84130           MAIN
1  0200.065.765              1         2008     41101           MAIN
2  0200.065.765              1         2003     70111           MAIN
3  0200.068.636              6         2008     36000           MAIN
4  0200.068.636              1         2008     36000           MAIN

In [5]:
df_activity['EntityNumber'].value_counts()

2.163.164.138    613
2.174.935.681    547
2.036.350.890    501
2.173.586.292    494
2.175.653.085    425
                ...
0766.422.635       1
2.268.643.225      1
0766.422.239       1
2.268.643.423      1
2.331.747.267      1
Name: EntityNumber, Length: 2779241, dtype: int64

In [6]:
df_activity[df_activity['EntityNumber']=='2.163.164.138']

          EntityNumber  ActivityGroup  NaceVersion  NaceCode Classification
8924171  2.163.164.138              3         2003    141011           MAIN
8924172  2.163.164.138              3         2003     28110           MAIN
8924173  2.163.164.138              3         2003   2811001           MAIN
8924174  2.163.164.138              3         2003   2811002           MAIN
8924175  2.163.164.138              3         2003   2811003           MAIN
...                ...            ...          ...       ...            ...
8924779  2.163.164.138              3         2008     95210           SECO
8924780  2.163.164.138              3         2008   9522001           SECO
8924781  2.163.164.138              3         2008     95290           SECO
8924782  2.163.164.138              3         2008   9529008           SECO
8924783  2.163.164.138              3         2008   9603202           SECO

[613 rows x 5 columns]

In [7]:
df_address = pd.read_csv('CSV/address.csv',low_memory=False)
print(df_address.shape)
print(df_address.head())

(2706922, 13)
   EntityNumber TypeOfAddress CountryNL CountryFR Zipcode  \
0  0200.065.765          REGO       NaN       NaN    9070
1  0200.068.636          REGO       NaN       NaN    9000
2  0200.171.970          REGO       NaN       NaN    9000
3  0200.245.711          REGO       NaN       NaN    9500
4  0200.305.493          REGO       NaN       NaN    9520

        MunicipalityNL       MunicipalityFR        StreetNL        StreetFR  \
0         Destelbergen         Destelbergen   Panhuisstraat   Panhuisstraat
1                 Gent                 Gent     Stropstraat     Stropstraat
2                 Gent                 Gent      Brabantdam      Brabantdam
3       Geraardsbergen       Geraardsbergen  Hoge Buizemont  Hoge Buizemont
4  Sint-Lievens-Houtem  Sint-Lievens-Houtem  Gentsesteenweg  Gentsesteenweg

  HouseNumber  Box ExtraAddressInfo DateStrikingOff
0           1  NaN              NaN             NaN
1           1  NaN              NaN             NaN
2         101  NaN              NaN             NaN
3         247  NaN              NaN             NaN
4          1B  NaN              NaN             NaN

In [8]:
df_branch = pd.read_csv('CSV/branch.csv')
print(df_branch.shape)
print(df_branch.head())

(7438, 3)
              Id            StartDate EnterpriseNumber
0  9.000.006.626  1995-09-01 00:00:00     0257.883.408
1  9.000.008.210  1968-01-01 00:00:00     0400.051.358
2  9.000.008.705  1968-01-01 00:00:00     0400.067.095
3  9.000.009.594  1968-01-01 00:00:00     0400.150.140
4  9.000.011.574  1963-04-30 00:00:00     0400.291.680

In [9]:
df_code = pd.read_csv('CSV/code.csv')
print(df_code.shape)
print(df_code.head())

(14948, 4)
        Category Code Language        Description
0  ActivityGroup  001       FR      ActivitÃ©s TVA
1  ActivityGroup  001       NL   BTW-activiteiten
2  ActivityGroup  002       FR     ActivitÃ©s EDRL
3  ActivityGroup  002       NL  EDRL-activiteiten
4  ActivityGroup  003       FR          ActivitÃ©s

In [10]:
df_contact = pd.read_csv('CSV/contact.csv')
print(df_contact.shape)
print(df_contact.head())

(543631, 4)
   EntityNumber EntityContact ContactType                            Value
0  0200.362.408           ENT         TEL                     081 61 42 48
1  0200.362.408           ENT       EMAIL              secretariat@isbw.be
2  0201.105.843           ENT       EMAIL         officiel.ic-idea@idea.be
3  0201.310.929           ENT         TEL                     089/32.39.50
4  0201.310.929           ENT       EMAIL  henri.vandermeulen@iglimburg.be

In [11]:
df_denomination = pd.read_csv('CSV/denomination.csv')
print(df_denomination.shape)
print(df_denomination.head())

(3119421, 4)
   EntityNumber  Language  TypeOfDenomination  \
0  0200.065.765         2                   1
1  0200.065.765         2                   2
2  0200.068.636         2                   1
3  0200.068.636         2                   2
4  0200.171.970         0                   1

                                        Denomination
0               Intergemeentelijke Vereniging Veneco
1                                             Veneco
2  TUSSENGEMEENTELIJKE MAATSCHAPPIJ DER VLAANDERE...
3                                           T.M.V.W.
4                  Sanatorium-Hospitaal van Lemberge

In [12]:
df_enterprise = pd.read_csv('CSV/enterprise.csv')
print(df_enterprise.shape)
print(df_enterprise.head())

(1863292, 6)
  EnterpriseNumber Status  JuridicalSituation  TypeOfEnterprise  \
0     0200.065.765     AC                   0                 2
1     0200.068.636     AC                   0                 2
2     0200.171.970     AC                   0                 2
3     0200.245.711     AC                  12                 2
4     0200.305.493     AC                   0                 2

   JuridicalForm            StartDate
0          416.0  1960-08-09 00:00:00
1          417.0  1923-02-16 00:00:00
2          116.0  1968-01-01 00:00:00
3          116.0  1922-01-01 00:00:00
4          416.0  1922-01-01 00:00:00

In [13]:
df_establishment = pd.read_csv('CSV/establishment.csv')
print(df_establishment.shape)
print(df_establishment.head())

(1599835, 3)
  EstablishmentNumber            StartDate EnterpriseNumber
0       2.000.000.339  1974-11-01 00:00:00     0403.449.823
1       2.000.000.438  1964-09-01 00:00:00     0403.590.274
2       2.000.001.032  1967-01-17 00:00:00     0403.174.758
3       2.000.001.428  1964-09-01 00:00:00     0400.395.016
4       2.000.001.527  1967-02-01 00:00:00     0401.825.963

In [14]:
df_meta = pd.read_csv('CSV/meta.csv')
print(df_meta.shape)
print(df_meta.head())

(5, 2)
           Variable                Value
0      SnapshotDate           03-06-2022
1  ExtractTimestamp  05-06-2022 08:23:55
2       ExtractType                 full
3     ExtractNumber                  100
4           Version                1.0.0

### Summary

In [15]:
df_list = [df_activity, df_address, df_branch, df_code, df_contact, df_denomination, df_enterprise, df_establishment, df_meta]

In [16]:
for df in df_list:
    print(f'{df.shape}')

(19515324, 5)
(2706922, 13)
(7438, 3)
(14948, 4)
(543631, 4)
(3119421, 4)
(1863292, 6)
(1599835, 3)
(5, 2)

### Questions

#### Q1 Which percentage of the companies are under which juridical form?

In [17]:
df_enterprise.head()

,EnterpriseNumber,Status,JuridicalSituation,TypeOfEnterprise,JuridicalForm,StartDate
0,0200.065.765,AC,0,2,416.0,1960-08-09 00:00:00
1,0200.068.636,AC,0,2,417.0,1923-02-16 00:00:00
2,0200.171.970,AC,0,2,116.0,1968-01-01 00:00:00
3,0200.245.711,AC,12,2,116.0,1922-01-01 00:00:00
4,0200.305.493,AC,0,2,416.0,1922-01-01 00:00:00

In [18]:
df_code.head()

        Category Code Language        Description
0  ActivityGroup  001       FR      ActivitÃ©s TVA
1  ActivityGroup  001       NL   BTW-activiteiten
2  ActivityGroup  002       FR     ActivitÃ©s EDRL
3  ActivityGroup  002       NL  EDRL-activiteiten
4  ActivityGroup  003       FR          ActivitÃ©s

In [19]:
df_enterprise['PercentageQ1'] = 1 / df_enterprise.shape[0]

In [20]:
q1_df =  df_enterprise.groupby('JuridicalForm').sum()

/tmp/ipykernel_3537/3884521033.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  q1_df =  df_enterprise.groupby('JuridicalForm').sum()

In [21]:
q1_df

               JuridicalSituation  TypeOfEnterprise  PercentageQ1
JuridicalForm
1.0                             0                14  3.756792e-06
2.0                            36               320  8.586953e-05
3.0                            24             15346  4.117980e-03
6.0                         26958              9296  2.494510e-03
7.0                             0                 4  1.073369e-06
...                           ...               ...           ...
721.0                        1409             50356  1.351264e-02
722.0                           0               124  3.327444e-05
724.0                           0                 2  5.366845e-07
790.0                           0                18  4.830161e-06
999.0                          22              2066  5.543951e-04

[107 rows x 3 columns]

In [22]:
df_JuridicalForm = df_code.loc[(df_code['Category'] == 'JuridicalForm') & (df_code['Language'] == 'FR')]

In [23]:
df_JuridicalForm = df_JuridicalForm.rename(columns ={'Category':'Category','Code':'JuridicalForm','Language':'Language','Description':'Description'})
df_JuridicalForm = df_JuridicalForm.drop(columns=['Category','Language'],axis=1)

In [24]:
df_JuridicalForm['JuridicalForm'] = df_JuridicalForm['JuridicalForm'].astype(int)

In [25]:
df_JuridicalForm.dtypes

JuridicalForm     int64
Description      object
dtype: object

In [26]:
q1_df.dtypes

JuridicalSituation      int64
TypeOfEnterprise        int64
PercentageQ1          float64
dtype: object

In [27]:
q1_df = pd.merge(q1_df, df_JuridicalForm,
    how='left', on='JuridicalForm')
q1_df

,JuridicalForm,JuridicalSituation,TypeOfEnterprise,PercentageQ1,Description
0,1.0,0,14,3.756792e-06,SociÃ©tÃ© coopÃ©rative europÃ©enne
1,2.0,36,320,8.586953e-05,Organisme de financement de pensions
2,3.0,24,15346,4.117980e-03,UnitÃ© TVA
3,6.0,26958,9296,2.494510e-03,SociÃ©tÃ© coopÃ©rative Ã responsabilitÃ© illimitÃ©e
4,7.0,0,4,1.073369e-06,SociÃ©tÃ© coopÃ©rative Ã responsabilitÃ© illimitÃ©e...
...,...,...,...,...,...
102,721.0,1409,50356,1.351264e-02,SociÃ©tÃ© ou association sans personnalitÃ© jurid...
103,722.0,0,124,3.327444e-05,Association momentanÃ©e
104,724.0,0,2,5.366845e-07,Syndicat
105,790.0,0,18,4.830161e-06,Divers sans personnalitÃ© juridique
106,999.0,22,2066,5.543951e-04,Forme lÃ©gale inconnue (ONSS)

In [28]:
q1_df = q1_df[['JuridicalForm','Description','PercentageQ1']]
q1_df.sort_values('PercentageQ1')
q1_df

,JuridicalForm,Description,PercentageQ1
0,1.0,SociÃ©tÃ© coopÃ©rative europÃ©enne,3.756792e-06
1,2.0,Organisme de financement de pensions,8.586953e-05
2,3.0,UnitÃ© TVA,4.117980e-03
3,6.0,SociÃ©tÃ© coopÃ©rative Ã responsabilitÃ© illimitÃ©e,2.494510e-03
4,7.0,SociÃ©tÃ© coopÃ©rative Ã responsabilitÃ© illimitÃ©e...,1.073369e-06
...,...,...,...
102,721.0,SociÃ©tÃ© ou association sans personnalitÃ© jurid...,1.351264e-02
103,722.0,Association momentanÃ©e,3.327444e-05
104,724.0,Syndicat,5.366845e-07
105,790.0,Divers sans personnalitÃ© juridique,4.830161e-06
106,999.0,Forme lÃ©gale inconnue (ONSS),5.543951e-04

#### Q2 Which percentage of the companies are under which Status?

In [29]:
df_enterprise['Status'].value_counts()

AC    1863292
Name: Status, dtype: int64

#### Q3 Which percentage of the companies are which type of entreprise?

In [30]:
df_enterprise['TypeOfEnterprise'].value_counts()

2    1099649
1     763643
Name: TypeOfEnterprise, dtype: int64

In [31]:
df_code.loc[(df_code['Category'] == 'TypeOfEnterprise') & (df_code['Language'] == 'FR')]

               Category Code Language        Description
14942  TypeOfEnterprise    0       FR            Inconnu
14944  TypeOfEnterprise    1       FR  Personne physique
14946  TypeOfEnterprise    2       FR    Personne morale

In [32]:
q3_df = df_enterprise.groupby('TypeOfEnterprise').sum()

/tmp/ipykernel_3537/2155232737.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  q3_df = df_enterprise.groupby('TypeOfEnterprise').sum()

In [33]:
q3_df

                  JuridicalSituation  JuridicalForm  PercentageQ1
TypeOfEnterprise
1                             269066            0.0      0.409835
2                            3926293    159550652.0      0.590165

In [34]:
q3_df.columns
#q3_df['Description'] = q3_df['Description'].map({1:'Personne physique',2:'Personne morale'})

Index(['JuridicalSituation', 'JuridicalForm', 'PercentageQ1'], dtype='object')

In [35]:
q3_df

                  JuridicalSituation  JuridicalForm  PercentageQ1
TypeOfEnterprise
1                             269066            0.0      0.409835
2                            3926293    159550652.0      0.590165

Trial ODT

In [36]:
df_enterprise.columns

Index(['EnterpriseNumber', 'Status', 'JuridicalSituation', 'TypeOfEnterprise',
       'JuridicalForm', 'StartDate', 'PercentageQ1'],
      dtype='object')

In [37]:
df_enterprise['TypeOfEnterprise_desc'] = np.where(df_enterprise['TypeOfEnterprise']==1,'Personne physique','Personne Morale')

In [38]:
df_enterprise

,EnterpriseNumber,Status,JuridicalSituation,TypeOfEnterprise,JuridicalForm,StartDate,PercentageQ1,TypeOfEnterprise_desc
0,0200.065.765,AC,0,2,416.0,1960-08-09 00:00:00,5.366845e-07,Personne Morale
1,0200.068.636,AC,0,2,417.0,1923-02-16 00:00:00,5.366845e-07,Personne Morale
2,0200.171.970,AC,0,2,116.0,1968-01-01 00:00:00,5.366845e-07,Personne Morale
3,0200.245.711,AC,12,2,116.0,1922-01-01 00:00:00,5.366845e-07,Personne Morale
4,0200.305.493,AC,0,2,416.0,1922-01-01 00:00:00,5.366845e-07,Personne Morale
...,...,...,...,...,...,...,...,...
1863287,0998.603.518,AC,0,2,230.0,2001-01-01 00:00:00,5.366845e-07,Personne Morale
1863288,0998.603.617,AC,0,2,230.0,2001-01-01 00:00:00,5.366845e-07,Personne Morale
1863289,0998.604.211,AC,0,2,230.0,2001-09-15 00:00:00,5.366845e-07,Personne Morale
1863290,0998.604.607,AC,0,2,230.0,2003-05-07 00:00:00,5.366845e-07,Personne Morale
1863291,0998.605.201,AC,0,2,230.0,2001-12-31 00:00:00,5.366845e-07,Personne Morale

In [39]:
print(df_enterprise.groupby('TypeOfEnterprise').sum())

                  JuridicalSituation  JuridicalForm  PercentageQ1
TypeOfEnterprise
1                             269066            0.0      0.409835
2                            3926293    159550652.0      0.590165

/tmp/ipykernel_3537/873329481.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(df_enterprise.groupby('TypeOfEnterprise').sum())

#### Q4 What is the average company's age in each sector (hint: look what is the NACE code)?

In [40]:
#Calculate the age of the company, creation vs today, add Sector to the table and group by sector

In [62]:
#Add Sector to Enterprise
df_activity_q4 = df_activity
df_activity_q4

           EntityNumber  ActivityGroup  NaceVersion  NaceCode Classification
0          0200.065.765              6         2008     84130           MAIN
1          0200.065.765              1         2008     41101           MAIN
2          0200.065.765              1         2003     70111           MAIN
3          0200.068.636              6         2008     36000           MAIN
4          0200.068.636              1         2008     36000           MAIN
...                 ...            ...          ...       ...            ...
19515319  2.331.747.168              3         2008     74104           MAIN
19515320  2.331.747.168              3         2008     85599           MAIN
19515321  2.331.747.168              3         2008     86904           MAIN
19515322  2.331.747.168              3         2008     96099           MAIN
19515323  2.331.747.267              3         2008     71111           MAIN

[19515324 rows x 5 columns]

In [63]:
df_enterprise_q4 = df_enterprise.drop(["Status","JuridicalSituation","TypeOfEnterprise","JuridicalForm"], axis=1)
now = pd.Timestamp('now')
df_enterprise_q4['age'] = now - (pd.to_datetime(df_enterprise_q4['StartDate'], format='%Y-%m-%d %H:%M:%S'))
df_enterprise_q4.dtypes

EnterpriseNumber                  object
StartDate                         object
PercentageQ1                     float64
TypeOfEnterprise_desc             object
age                      timedelta64[ns]
dtype: object

In [64]:
df_enterprise_q4['age'] = df_enterprise_q4['age'].astype("timedelta64[D]")/ 365.2425

In [66]:
df_enterprise_q4.dtypes

EnterpriseNumber          object
StartDate                 object
PercentageQ1             float64
TypeOfEnterprise_desc     object
age                      float64
dtype: object

In [67]:
df_enterprise_q4_merge = df_enterprise_q4.drop(['StartDate','PercentageQ1','TypeOfEnterprise_desc'],axis=1)
df_enterprise_q4_merge

        EnterpriseNumber         age
0           0200.065.765   62.213461
1           0200.068.636   99.692670
2           0200.171.970   54.818374
3           0200.245.711  100.817950
4           0200.305.493  100.817950
...                  ...         ...
1863287     0998.603.518   21.815643
1863288     0998.603.617   21.815643
1863289     0998.604.211   21.112001
1863290     0998.604.607   19.471995
1863291     0998.605.201   20.819045

[1863292 rows x 2 columns]

In [68]:
df_enterprise_q4_merge = df_enterprise_q4_merge.rename(columns={'EnterpriseNumber':	'EntityNumber','age':'age'})
df_enterprise_q4_merge

         EntityNumber         age
0        0200.065.765   62.213461
1        0200.068.636   99.692670
2        0200.171.970   54.818374
3        0200.245.711  100.817950
4        0200.305.493  100.817950
...               ...         ...
1863287  0998.603.518   21.815643
1863288  0998.603.617   21.815643
1863289  0998.604.211   21.112001
1863290  0998.604.607   19.471995
1863291  0998.605.201   20.819045

[1863292 rows x 2 columns]

In [80]:
df_enterprise_q4_merge.isna().sum()

EntityNumber    0
age             1
dtype: int64

In [47]:
q4_df = df_activity
q4_df

           EntityNumber  ActivityGroup  NaceVersion  NaceCode Classification
0          0200.065.765              6         2008     84130           MAIN
1          0200.065.765              1         2008     41101           MAIN
2          0200.065.765              1         2003     70111           MAIN
3          0200.068.636              6         2008     36000           MAIN
4          0200.068.636              1         2008     36000           MAIN
...                 ...            ...          ...       ...            ...
19515319  2.331.747.168              3         2008     74104           MAIN
19515320  2.331.747.168              3         2008     85599           MAIN
19515321  2.331.747.168              3         2008     86904           MAIN
19515322  2.331.747.168              3         2008     96099           MAIN
19515323  2.331.747.267              3         2008     71111           MAIN

[19515324 rows x 5 columns]

In [69]:
q4_df = pd.merge(q4_df, df_enterprise_q4_merge,
    how='left', on='EntityNumber')

In [81]:
q4_df.isna()

,EntityNumber,ActivityGroup,NaceVersion,NaceCode,Classification,age
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
19515319,False,False,False,False,False,True
19515320,False,False,False,False,False,True
19515321,False,False,False,False,False,True
19515322,False,False,False,False,False,True
19515323,False,False,False,False,False,True

In [73]:
x = 15795228 / 19515324
x

0.8093756475680343

In [79]:
df_enterprise['StartDate'].describe()

count                 1863291
unique                  30011
top       1995-08-01 00:00:00
freq                    17688
Name: StartDate, dtype: object

In [94]:
df_enterprise[df_enterprise['StartDate']=='1800-01-01 00:00:00']

,EnterpriseNumber,Status,JuridicalSituation,TypeOfEnterprise,JuridicalForm,StartDate,PercentageQ1,TypeOfEnterprise_desc
371706,0500.044.797,AC,0,1,NaN,1800-01-01 00:00:00,5.366845e-07,Personne physique
371726,0500.214.152,AC,0,1,NaN,1800-01-01 00:00:00,5.366845e-07,Personne physique
371729,0500.218.409,AC,0,1,NaN,1800-01-01 00:00:00,5.366845e-07,Personne physique
371730,0500.219.496,AC,0,1,NaN,1800-01-01 00:00:00,5.366845e-07,Personne physique
371746,0500.252.358,AC,0,1,NaN,1800-01-01 00:00:00,5.366845e-07,Personne physique
...,...,...,...,...,...,...,...,...
1863140,0998.550.068,AC,0,2,230.0,1800-01-01 00:00:00,5.366845e-07,Personne Morale
1863144,0998.551.157,AC,0,2,230.0,1800-01-01 00:00:00,5.366845e-07,Personne Morale
1863145,0998.551.355,AC,0,2,230.0,1800-01-01 00:00:00,5.366845e-07,Personne Morale
1863146,0998.551.553,AC,0,2,230.0,1800-01-01 00:00:00,5.366845e-07,Personne Morale
1863149,0998.552.147,AC,0,2,230.0,1800-01-01 00:00:00,5.366845e-07,Personne Morale

In [96]:
df_activity['NACE_xx'] = df_activity['NaceCode'].apply(lambda x : str(x)[:2])

In [ ]:
#Drop all Nace2003

In [102]:
#map code 
df_code_nace = df_code.loc[(df_code['Category'] == 'Nace2008')&(df_code['Language'] == 'FR')&(df_code['Code']<=99)]
df_code_nace

TypeError: '<=' not supported between instances of 'str' and 'int'

In [97]:
df_activity

,EntityNumber,ActivityGroup,NaceVersion,NaceCode,Classification,NACE_xx
0,0200.065.765,6,2008,84130,MAIN,84
1,0200.065.765,1,2008,41101,MAIN,41
2,0200.065.765,1,2003,70111,MAIN,70
3,0200.068.636,6,2008,36000,MAIN,36
4,0200.068.636,1,2008,36000,MAIN,36
...,...,...,...,...,...,...
19515319,2.331.747.168,3,2008,74104,MAIN,74
19515320,2.331.747.168,3,2008,85599,MAIN,85
19515321,2.331.747.168,3,2008,86904,MAIN,86
19515322,2.331.747.168,3,2008,96099,MAIN,96
19515323,2.331.747.267,3,2008,71111,MAIN,71

### Sidebar

In [44]:
#SIDEBAR

#Filter setup
#FILTER HEADER
st.sidebar.header("Filter data")

#FILTER
city = st.sidebar.multiselect(  #Variable defirnition
    "By City:",  #Title of the filter
    options=df["City"].unique(),  #Column to filter
    default=df["City"].unique()  #Set default value to all
)

#FILTER
customer_type = st.sidebar.multiselect(  #Variable defirnition
    "By Customer type:",  #Title of the filter
    options=df["Customer_type"].unique(),  #Column to filter
    default=df["Customer_type"].unique()  #Set default value to all
)

#FILTER
gender = st.sidebar.multiselect(  #Variable defirnition
    "By Gender:",  #Title of the filter
    options=df["Gender"].unique(),  #Column to filter
    default=df["Gender"].unique()  #Set default value to all
)

#FILTER
payment = st.sidebar.multiselect(  #Variable defirnition
    "By Payment method:",  #Title of the filter
    options=df["Payment"].unique(),  #Column to filter
    default=df["Payment"].unique()  #Set default value to all
)

2022-10-26 11:46:19.885
  Warning: to view this Streamlit app on a browser, run it with the following
  command:

    streamlit run /home/david/MyGithub/challenge-data-analysis-sql/env/lib/python3.10/site-packages/ipykernel_launcher.py [ARGUMENTS]

KeyboardInterrupt

#### Filtered information
ater we apply the filter, use this value for everything

In [ ]:
#Filtered information
df_filtered_data = df.query(
    "City == @city & Customer_type == @customer_type & Gender == @gender & Payment == @payment"
)

### Main page

In [ ]:
#MAINPAGE
st.title("Sales Dashboard")
st.markdown("##")

#### Section 1 KPI

In [ ]:
#KPI
sales_total = int(df_filtered_data["Total"].sum())  #return the sum of the total column
rating_average = round(df_filtered_data["Rating"].mean(),1)  #returns the average rating
rating_star = ":star:" * int(round(rating_average,0))
sales_by_transaction_average = round(df_filtered_data["Total"].mean(),2)

column_1, column_2, column_3 = st.columns(3)
with column_1:
    st.subheader("Total Sales:")
    st.subheader(f"US ${sales_total:,}")
with column_2:
    st.subheader("Average Rating:")
    st.subheader(f"{rating_average} {rating_star}")
with column_3:
    st.subheader("Average sales per transaction")
    st.subheader(f"US ${sales_by_transaction_average:,}")

In [ ]:
st.markdown("---")

#### Section 2 Charts

In [ ]:
#Chart
sales_by_product_line = (
    df_filtered_data.groupby(by=["Product line"]).sum()[["Total"]].sort_values(by="Total")
)

sales_by_product_line_chart = px.bar(
    sales_by_product_line,
    x="Total",
    y=sales_by_product_line.index,
    orientation="h",
    title="<b>Sales by Product Line Chart</b>",
    color_discrete_sequence=["#3783A1"] * len(sales_by_product_line),
    template="plotly_white",
)

sales_by_product_line_chart.update_layout(
    plot_bgcolor="rgba(0,0,0,0)",
    xaxis=(dict(showgrid=False))
)

#Chart
sales_by_hour = (
    df_filtered_data.groupby(by=["hour"]).sum()[["Total"]]
)

sales_by_hour_chart = px.line(
    sales_by_hour,
    x=sales_by_hour.index,
    y="Total",
    title="<b>Sales by hour Chart</b>",
    color_discrete_sequence=["#3783A1"] * len(sales_by_product_line),
    template="plotly_white",
)

sales_by_hour_chart.update_layout(
    xaxis=dict(tickmode="linear"),
    plot_bgcolor="rgba(0,0,0,0)",
    yaxis=(dict(showgrid=False)),
)

column_1, column_2 = st.columns(2)  #arrange charts next to each other
column_1.plotly_chart(sales_by_product_line_chart, use_container_width=True)
column_2.plotly_chart(sales_by_hour_chart, use_container_width=True)

#### Section 3

In [ ]:
#Hide streamlit style
st_style = """
<style>
#MainMenu {visibility:hidden;}
footer {visibility:hidden;}
header {visibility:hidden;}
</style> 
"""

st.markdown(st_style, unsafe_allow_html=True)

st.dataframe(df_filtered_data)  #returns the dataframe

## Setup

have to make a folder that contains this file
* .streamlit/
  * config.toml

In [ ]:

[theme]
# Primary accent color for interactive elements.
primaryColor = "#1D4454"

# Background color for the main content area.
backgroundColor = "#FAFCFD"

# Background color used for the sidebar and most interactive widgets.
secondaryBackgroundColor = "#6FB3CE"

# Color used for almost all text.
textColor = "#0A2A37"

# Font family for all text in the app, except code blocks. One of "sans serif", "serif", or "monospace".
# Default: "sans serif"
font = "sans serif"